
read_verilog Mux4a2_descp_condL1.v

hierarchy -check -top mux_4to1

proc; opt; fsm; opt; memory; opt

techmap; opt

dfflibmap -liberty cmos_cells.lib

abc -liberty cmos_cells.lib

clean

write_verilog muxEstruct.v
