
read_verilog circulacion.v

hierarchy -check -top circulacion

proc; opt; fsm; opt; memory; opt

techmap; opt

dfflibmap -liberty cmos_cells.lib

abc -liberty cmos_cells.lib

clean

write_verilog recirculacionEstruct.v
